In [1]:
import pandas as pd
# Create sample DataFrames
df1 = pd.DataFrame({'A': [1, 2], 'B': [3, 4]})
df2 = pd.DataFrame({'A': [5, 6], 'B': [7, 8]})

In [25]:
# Concatenate
pd.concat([df1, df2])

   A  B
0  1  3
1  2  4
0  5  7
1  6  8

In [35]:
# Concatenate along rows (axis=0) with reset_index
result=pd.concat([df1, df2], axis=0)
result.reset_index()

   index  A  B
0      0  1  3
1      1  2  4
2      0  5  7
3      1  6  8

In [47]:
# Concatenate along columns (axis=0) with drop index
row_result = pd.concat([df1, df2], axis=0)
row_result.reset_index(drop=True)

   A  B
0  1  3
1  2  4
2  5  7
3  6  8

In [51]:
# Concatenate along columns (axis=1)
pd.concat([df1, df2], axis=1)

   A  B  A  B
0  1  3  5  7
1  2  4  6  8

In [49]:
# Concatenate along columns (axis=1) with ignore_index
pd.concat([df1, df2], axis=1, ignore_index=True)

   0  1  2  3
0  1  3  5  7
1  2  4  6  8

In [7]:
# Concatenate with inner join
pd.concat([df1, df2], axis=1, join='inner')

   A  B  A  B
0  1  3  5  7
1  2  4  6  8

In [9]:
# Concatenate with inner join
pd.concat([df1, df2], axis=1, join='outer')

   A  B  A  B
0  1  3  5  7
1  2  4  6  8

In [23]:
# Concatenate and ignore the index
pd.concat([df1, df2], ignore_index=True)

   A  B
0  1  3
1  2  4
2  5  7
3  6  8

In [81]:
# concat with Keys 
key_indexing= pd.concat([df1, df2], keys=['key_df1', 'key_df2'])
key_indexing

           A  B
key_df1 0  1  3
        1  2  4
key_df2 0  5  7
        1  6  8

In [85]:
type(key_indexing.index)

pandas.core.indexes.multi.MultiIndex

In [89]:
# Accessing data from multi_indexing
key_indexing.loc[('key_df2',0)]

A    5
B    7
Name: (key_df2, 0), dtype: int64

In [99]:
# complete information of 'key_df2'
key_indexing.loc[('key_df2')]

   A  B
0  5  7
1  6  8

In [119]:
# Required 'B' value of 'key_df2'
key_indexing.loc[('key_df2'),'B']

0    7
1    8
Name: B, dtype: int64

In [115]:
# Required 'B' value of 'key_df2'
key_indexing.loc[('key_df2', 'B')]

0    7
1    8
Name: B, dtype: int64

In [111]:
# Required 'B' value 8 of 'key_df2'
key_indexing.loc[('key_df2',1),'B']

8

In [67]:
# Keys with reset the index
result = pd.concat([df1, df2], keys=['df1', 'df2'])
result.reset_index()

  level_0  level_1  A  B
0     df1        0  1  3
1     df1        1  2  4
2     df2        0  5  7
3     df2        1  6  8

In [133]:
# Concatenate with  verify_integrity=False
pd.concat([df1, df2], verify_integrity=False)

   A  B
0  1  3
1  2  4
0  5  7
1  6  8

In [157]:
# Create a sample DataFrame with a multi-level index
arrays = [['a', 'a', 'b', 'b'], [1, 2, 1, 2],[15, 25, 15, 25]]
indexA = pd.MultiIndex.from_arrays(arrays, names=('letter', 'number','nos'))
df_multi = pd.DataFrame({'A': [10, 20, 30, 40]}, index=indexA)
df_multi

                    A
letter number nos
a      1      15   10
       2      25   20
b      1      15   30
       2      25   40

In [163]:
# Reset one level of the multi-level index
df_multi.reset_index(level=['letter','nos'])

       letter  nos   A
number
1           a   15  10
2           a   25  20
1           b   15  30
2           b   25  40